Documents/УДАЛИТЬ_УстановкаСтоимостиВыработкиПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УДАЛИТЬ_УстановкаСтоимостиВыработкиПроизводства</Name>
			<Comment>Установка стоимости выработки производства</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СтоимостьВыработкиПроизводства</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатурыПотолка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьЗаПозициюПродукцииРаскройщику</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьЗаПозициюПродукцииМенеджеру</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановитьСтоимостьЗаПозициюВВыпуске</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьЗаПозициюДелитсяНаВсехРаспройщиков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтоимостьВыработки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоВыработке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьДляМенеджера</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УДАЛИТЬ_УстановкаСтоимостиВыработкиПроизводства/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьНоменклатуруПоГруппе(ГруппаНоменклатуры)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В ИЕРАРХИИ(&ГруппаНоменклатура)
	|	И Номенклатура.ЭтоГруппа = Ложь";
	Запрос.УстановитьПараметр("ГруппаНоменклатура",ГруппаНоменклатуры);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.СтоимостьВыработки.Добавить();
		НоваяСтрока.Номенклатура = Выборка.Ссылка;
		НоваяСтрока.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьГруппуНоменклатуры(Команда)
	
    ФормаНоменклатура = ПолучитьФорму("Справочник.Номенклатура.ФормаВыбора", );
	ФормаНоменклатура.Элементы.Список.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.ГруппыИЭлементы;
    ВыбраннаяНоменклатура = ФормаНоменклатура.ОткрытьМодально();
	Если ВыбраннаяНоменклатура <> Неопределено Тогда
		Если Объект.СтоимостьВыработки.Количество() > 0 Тогда
			Если Вопрос("Табличная часть не пустая. Очистить?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				Объект.СтоимостьВыработки.Очистить();
			КонецЕсли;
		КонецЕсли;
		ЗаполнитьНоменклатуруПоГруппе(ВыбраннаяНоменклатура);
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаСервере
Процедура КомандаУстановитьСтоимостьВыработкиНаСервере(НоваяСтоимость, КолонкаТаблицы)
	Для Каждого ТекущаяСтрока Из Объект.СтоимостьВыработки Цикл
		ТекущаяСтрока[КолонкаТаблицы] = НоваяСтоимость;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьСтоимостьВыработки(Команда)
	НоваяСтоимость = 0;
	ВвестиЗначение(НоваяСтоимость,"Введите цену", Новый ОписаниеТипов("число"));
	
	КомандаУстановитьСтоимостьВыработкиНаСервере(НоваяСтоимость, "Стоимость");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		ОбщийМодуль.ЗаполнитьШапкуДокумента(Объект);
	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
	
	Элементы.СтоимостьВыработкиГруппаСтоимость.Заголовок = "Цена выработки, " + Константы.ВалютаУчета.Получить().Наименование;
	
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьВыработкиНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.СтоимостьВыработки.ТекущиеДанные;
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(Знач Номенклатура)
	Возврат Номенклатура.БазоваяЕдиницаИзмерения;
КонецФункции

&НаКлиенте
Процедура СтоимостьВыработкиЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.СтоимостьВыработки.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;  	

КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьЦенуВыработкиДляМенеджера(Команда)
	НоваяСтоимость = 0;
	ВвестиЗначение(НоваяСтоимость,"Введите цену", Новый ОписаниеТипов("число"));
	
	КомандаУстановитьСтоимостьВыработкиНаСервере(НоваяСтоимость, "СтоимостьДляМенеджера");
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыФормы()
	
	//Элементы.СтоимостьЗаПозициюПродукцииРаскройщику.Видимость = Объект.УстановитьСтоимостьЗаПозициюВВыпуске;
	Элементы.ГруппаСтоимостьЗаПозициюДляРаскройщиков.Видимость = Объект.УстановитьСтоимостьЗаПозициюВВыпуске;
	Элементы.СтоимостьЗаПозициюПродукцииМенеджеру.Видимость = Объект.УстановитьСтоимостьЗаПозициюВВыпуске;
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтоимостьЗаПозициюВВыпускеПриИзменении(Элемент)
	ОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьЭлементыФормы();
КонецПроцедуры
